== installation

On Linux or Mac OS X:

<<< ruby
$ sudo gem install doodle
>>>

On Windows:

<<< ruby
C:\> gem install doodle
>>>

== initialization

<<< ruby
require 'doodle'

class Event < Doodle
  has :date
end
>>>

With this declaration, you can now initialize an instance of Event in the following ways.

=== using positional arguments

<<< ruby
event = Event Date.today
>>>

=== named arguments

<<< ruby
event = Event :date => Date.today
>>>

=== block initialization

<<< ruby
event = Event do
  date Date.today
end
>>>

Of course, if you insist on typing @new@, you can:

<<< ruby
event = Event.new(:date => Date.today)
>>>

